; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	image2 - mode
	thermograph1 - mode
	thermograph0 - mode
	image3 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image3)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 image3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(have_image Star6 image2)
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph0)
	(have_image Star9 image2)
	(have_image Phenomenon10 image3)
	(have_image Star11 thermograph1)
	(have_image Planet12 image2)
	(have_image Planet13 thermograph1)
	(have_image Star14 image2)
	(have_image Star15 thermograph0)
))

)

; plan
1. (turn_to satellite1 star0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star0)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 planet13 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet13)
   goals met: 0 of 10
5. (take_image satellite1 planet13 instrument3 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 10
7. (turn_to satellite0 star0 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star0)
   goals met: 1 of 10
8. (take_image satellite1 phenomenon10 instrument3 image3)
   added: (have_image phenomenon10 image3)
   goals met: 2 of 10
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
10. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 10
11. (turn_to satellite0 planet12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet12)
   goals met: 2 of 10
12. (take_image satellite0 planet12 instrument1 image2)
   added: (have_image planet12 image2)
   goals met: 3 of 10
13. (turn_to satellite0 star14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star14)
   goals met: 3 of 10
14. (take_image satellite0 star14 instrument1 image2)
   added: (have_image star14 image2)
   goals met: 4 of 10
15. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 4 of 10
16. (take_image satellite0 star15 instrument1 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 5 of 10
17. (turn_to satellite0 star6 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star6)
   goals met: 5 of 10
18. (take_image satellite0 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 6 of 10
19. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 6 of 10
20. (take_image satellite0 star8 instrument1 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 7 of 10
21. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
22. (take_image satellite0 star9 instrument1 image2)
   added: (have_image star9 image2)
   goals met: 8 of 10
23. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 8 of 10
24. (take_image satellite1 star11 instrument3 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 9 of 10
25. (turn_to satellite1 star7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star7)
   goals met: 9 of 10
26. (take_image satellite1 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 10 of 10
